{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "JSON report mapping implemented features to the files they modify and their associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base/style layers defining a pastel light/dark theme using OKLCH color variables.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Main React component handling screen navigation and rendering feature screens with global music and theme controls.",
  "frontend/src/components/MusicControl.tsx": "UI control for playing, pausing, and muting ambient music using the useAmbientMusic hook.",
  "frontend/src/components/sections/BubbleGameCard.tsx": "Relax-mode mini‑game that spawns tappable bubbles and plays a pop sound on click.",
  "frontend/src/components/sections/DailyQuoteCard.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/sections/DarkModeToggle.tsx": "Button that switches light/dark themes with persistence in localStorage.",
  "frontend/src/components/sections/NotesCard.tsx": "Notes editor with textarea input and save-to-localStorage functionality.",
  "frontend/src/components/sections/RemindersCard.tsx": "Self-care reminder buttons triggering notifications or alerts depending on browser permissions.",
  "frontend/src/components/sections/TodoCard.tsx": "To‑do list card allowing task creation, completion toggling, and inline input handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAmbientMusic.ts": "Manages ambient background music playback, mute state, and persistence via localStorage using a ref-based audio element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles AuthClient setup, login, logout, and restoring saved identities.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes, plus custom utility classes for themed backgrounds.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/FeatureScreenShell.tsx": "Shared layout wrapper that provides a title, back button, and styled container for feature pages.",
  "frontend/src/pages/MenuScreen.tsx": "Renders a central menu card with navigation buttons for the app's main features.",
  "frontend/src/pages/OpeningScreen.tsx": "Displays the introductory screen with a greeting and a button to proceed.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors from CSS variables and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing the app’s goals, implemented features, architecture notes, and known issues."
}