{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five features related to parsing HTML structure, applying Comic Sans MS font, implementing gradient backgrounds, section display logic, and extracting interactive features from the original HTML source.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for todo lists, notes, reminders, quotes, bubble game, music controls, dark mode, navigation screens, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes, including pink-themed color tokens for backgrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with title 'Hello Girlies App' and Google Fonts imports for Pacifico and Poppins font families.",
  "frontend/src/App.tsx": "Main app component managing section-based navigation between opening, menu, and five feature screens (todo, reminder, notes, relax, quote) with fixed music/dark mode controls and caffeine.ai footer.",
  "frontend/src/components/MusicControl.tsx": "Music control UI with play/pause and mute/unmute buttons using the useAmbientMusic hook for background music management.",
  "frontend/src/components/sections/BubbleGameCard.tsx": "Bubble pop mini-game that auto-spawns clickable bubbles with sound effects, positioned randomly within a pink-themed game area.",
  "frontend/src/components/sections/DailyQuoteCard.tsx": "Daily quote display component showing random motivational quotes from a set of 10, with a refresh button to cycle through quotes.",
  "frontend/src/components/sections/DarkModeToggle.tsx": "Icon-only dark mode toggle button that switches between light and dark themes with localStorage persistence and system preference detection.",
  "frontend/src/components/sections/NotesCard.tsx": "Notes textarea component with localStorage persistence, save button, and temporary save confirmation message.",
  "frontend/src/components/sections/RemindersCard.tsx": "A card component that displays four self-care reminder buttons (water, hair, exercise, self-care) and triggers browser notifications or alerts when clicked. Handles notification permission requests and displays status alerts for unsupported or denied notifications.",
  "frontend/src/components/sections/TodoCard.tsx": "A todo list card component with add, toggle, and delete functionality that persists todos to localStorage. Displays an input field with a plus button and renders a list of todos with strikethrough styling for completed items.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and manages an ICP backend actor using React Query, switching between authenticated and anonymous actors based on Internet Identity login state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAmbientMusic.ts": "A custom hook that manages ambient background music playback with play/pause and mute controls, persisting the music state to localStorage. Loads a looping piano track and provides ready state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication on ICP, managing login/logout flow and identity state. Handles AuthClient creation, delegation validation, and provides login status tracking with automatic identity restoration from storage.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration with custom CSS variables for light and dark themes using oklch color space. Sets up pastel pink/purple color schemes, custom utility classes, and Comic Sans font styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component. Initializes the QueryClient and wraps the app with necessary context providers.",
  "frontend/src/pages/FeatureScreenShell.tsx": "A reusable layout component that provides a consistent shell for feature screens with a back button, title, and content area. Used to wrap individual feature pages with standardized styling and navigation.",
  "frontend/src/pages/MenuScreen.tsx": "Main menu screen component displaying five navigation buttons (To-Do List, Self Reminder, Notes, Relax Yourself, Daily Quote) in a centered card. Accepts an onNavigate callback to handle screen transitions.",
  "frontend/src/pages/OpeningScreen.tsx": "Initial welcome screen component displaying a greeting message \"For My Best Friend\" with a tagline and a Next button. Serves as the app's landing page before navigating to the main menu.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom theme with Comic Sans font, OKLCH color system using CSS variables for light/dark modes, extended spacing/shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document describing a girly self-care web app with dark mode, to-do list, notes (localStorage), notification-based reminders, daily quotes, and a bubble pop game; lists implemented features, architectural notes, and requirement mappings."
}